Autodesk.Revit.DB.NurbSpline.Create(Autodesk.Revit.DB.HermiteSpline)
Creates a new geometric NurbSpline object from a HermiteSpline.
hermiteSpline:
The hermite spline that will be converted to NurbSpline.
Returns:
The new NurbSpline object.
Since:
2017

Autodesk.Revit.DB.NurbSpline.CreateCurve(Autodesk.Revit.DB.HermiteSpline)
Creates a new geometric Curve object by converting the given HermiteSpline.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
The function does not support periodic Hermite curve.
hermiteSpline:
The HermiteSpline that will be converted.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given hermite spline has to be non-periodic.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.NurbSpline.CreateCurve(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Double})
Creates a new geometric Curve object from NURBS curve data containing just control points and weights.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
There must be at least 2 control points.
The number of weights must be equal to the the number of control points.
The values of all weights must be positive.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The number of control points must be at least 2.
-or-
The number of weights must be the same as the number of control points and all weights must be positive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2017

Autodesk.Revit.DB.NurbSpline.CreateCurve(System.Int32,System.Collections.Generic.IList{System.Double},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Double})
Creates a new geometric Curve object from NURBS curve data, which includes weights.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
Degree must be 1 or greater.
The number of control points must be greater than degree.
The number of knots must equal the sum of degree, number of controlPoints and 1.
The distinct knot values (ignoring multiplicities) must be in increasing order.
The first degree+1 knots should be identical, as should the last degree+1 knots.
The multiplicities of other (interior) knots should be less than degree -1.
The number of weights must be equal to the the number of control points.
The values of all weights must be positive.
degree:
The degree of the NURBSpline.
knots:
The knots of the NURBSpline.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The degree must be at least 1.
-or-
The number of control points must be greater than degree.
-or-
The number of knots must equal the sum of number of control points, degree and 1.
-or-
An interior knot must not repeat itself more than degree times.
-or-
The number of weights must be the same as the number of control points and all weights must be positive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2017

Autodesk.Revit.DB.NurbSpline.CreateCurve(System.Int32,System.Collections.Generic.IList{System.Double},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new geometric Curve object from NURBS curve data, which does not include weights.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
Degree must be 1 or greater.
The number of control points must be greater than degree.
The number of knots must equal the sum of degree, number of controlPoints and 1.
The distinct knot values (ignoring multiplicities) must be in increasing order.
The first degree+1 knots should be identical, as should the last degree+1 knots.
The multiplicities of other (interior) knots should be less than degree -1.
degree:
The degree of the NURBSpline.
knots:
The knots of the NURBSpline.
controlPoints:
The control points of the NURBSpline.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The degree must be at least 1.
-or-
The number of control points must be greater than degree.
-or-
The number of knots must equal the sum of number of control points, degree and 1.
-or-
An interior knot must not repeat itself more than degree times.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2017

Autodesk.Revit.DB.NurbSpline.SetControlPointsAndWeights(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.DoubleArray)
Set the control points, weights simultaneously.

Autodesk.Revit.DB.NurbSpline.Knots
Return/set the knots of the nurb spline.

Autodesk.Revit.DB.NurbSpline.Weights
Returns the weights of the nurb spline.

Autodesk.Revit.DB.NurbSpline.CtrlPoints
Returns the control points of the nurb spline.

Autodesk.Revit.DB.NurbSpline.Degree
Returns the degree of the nurb spline.

Autodesk.Revit.DB.NurbSpline.isRational
Returns whether the nurb spline is rational or not.

Autodesk.Revit.DB.NurbSpline.isClosed
Return/set the nurb spline's isClosed property.

Autodesk.Revit.DB.NurbSpline
A nurb spline.
Remarks: The nurb spline lies in the plane defined by control point, weight,knots,degree.